ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32660/Libraries/PeriphDrivers/Source/SPI/spi_reva_regs.h
/**@} end of group SPI_SSTIME_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_CLKCTRL SPI_CLKCTRL
 * @brief    Register for controlling SPI clock rate.
 * @{
 */
 #define MXC_F_SPI_REVA_CLKCTRL_LO_POS                       0 /**< CLKCTRL_LO Position */
 #define MXC_F_SPI_REVA_CLKCTRL_LO                           ((uint32_t)(0xFFUL << MXC_F_SPI_REVA_CLKCTRL_LO_POS)) /**< CLKCTRL_LO Mask */
 #define MXC_V_SPI_REVA_CLKCTRL_LO_DIS                       ((uint32_t)0x0UL) /**< CLKCTRL_LO_DIS Value */
 #define MXC_S_SPI_REVA_CLKCTRL_LO_DIS                       (MXC_V_SPI_REVA_CLKCTRL_LO_DIS << MXC_F_SPI_REVA_CLKCTRL_LO_POS) /**< CLKCTRL_LO_DIS Setting */

 #define MXC_F_SPI_REVA_CLKCTRL_HI_POS                       8 /**< CLKCTRL_HI Position */
 #define MXC_F_SPI_REVA_CLKCTRL_HI                           ((uint32_t)(0xFFUL << MXC_F_SPI_REVA_CLKCTRL_HI_POS)) /**< CLKCTRL_HI Mask */
 #define MXC_V_SPI_REVA_CLKCTRL_HI_DIS                       ((uint32_t)0x0UL) /**< CLKCTRL_HI_DIS Value */
 #define MXC_S_SPI_REVA_CLKCTRL_HI_DIS                       (MXC_V_SPI_REVA_CLKCTRL_HI_DIS << MXC_F_SPI_REVA_CLKCTRL_HI_POS) /**< CLKCTRL_HI_DIS Setting */

 #define MXC_F_SPI_REVA_CLKCTRL_CLKDIV_POS                   16 /**< CLKCTRL_CLKDIV Position */
 #define MXC_F_SPI_REVA_CLKCTRL_CLKDIV                       ((uint32_t)(0xFUL << MXC_F_SPI_REVA_CLKCTRL_CLKDIV_POS)) /**< CLKCTRL_CLKDIV Mask */

/**@} end of group SPI_CLKCTRL_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_DMA SPI_DMA
 * @brief    Register for controlling DMA.
 * @{
 */
 #define MXC_F_SPI_REVA_DMA_TX_THD_VAL_POS                   0 /**< DMA_TX_THD_VAL Position */
 #define MXC_F_SPI_REVA_DMA_TX_THD_VAL                       ((uint32_t)(0x1FUL << MXC_F_SPI_REVA_DMA_TX_THD_VAL_POS)) /**< DMA_TX_THD_VAL Mask */

 #define MXC_F_SPI_REVA_DMA_TX_FIFO_EN_POS                   6 /**< DMA_TX_FIFO_EN Position */
 #define MXC_F_SPI_REVA_DMA_TX_FIFO_EN                       ((uint32_t)(0x1UL << MXC_F_SPI_REVA_DMA_TX_FIFO_EN_POS)) /**< DMA_TX_FIFO_EN Mask */

 #define MXC_F_SPI_REVA_DMA_TX_FLUSH_POS                     7 /**< DMA_TX_FLUSH Position */
 #define MXC_F_SPI_REVA_DMA_TX_FLUSH                         ((uint32_t)(0x1UL << MXC_F_SPI_REVA_DMA_TX_FLUSH_POS)) /**< DMA_TX_FLUSH Mask */

 #define MXC_F_SPI_REVA_DMA_TX_LVL_POS                       8 /**< DMA_TX_LVL Position */
 #define MXC_F_SPI_REVA_DMA_TX_LVL                           ((uint32_t)(0x3FUL << MXC_F_SPI_REVA_DMA_TX_LVL_POS)) /**< DMA_TX_LVL Mask */

 #define MXC_F_SPI_REVA_DMA_DMA_TX_EN_POS                    15 /**< DMA_DMA_TX_EN Position */
 #define MXC_F_SPI_REVA_DMA_DMA_TX_EN                        ((uint32_t)(0x1UL << MXC_F_SPI_REVA_DMA_DMA_TX_EN_POS)) /**< DMA_DMA_TX_EN Mask */

 #define MXC_F_SPI_REVA_DMA_RX_THD_VAL_POS                   16 /**< DMA_RX_THD_VAL Position */
 #define MXC_F_SPI_REVA_DMA_RX_THD_VAL                       ((uint32_t)(0x1FUL << MXC_F_SPI_REVA_DMA_RX_THD_VAL_POS)) /**< DMA_RX_THD_VAL Mask */

 #define MXC_F_SPI_REVA_DMA_RX_FIFO_EN_POS                   22 /**< DMA_RX_FIFO_EN Position */
 #define MXC_F_SPI_REVA_DMA_RX_FIFO_EN                       ((uint32_t)(0x1UL << MXC_F_SPI_REVA_DMA_RX_FIFO_EN_POS)) /**< DMA_RX_FIFO_EN Mask */

 #define MXC_F_SPI_REVA_DMA_RX_FLUSH_POS                     23 /**< DMA_RX_FLUSH Position */
 #define MXC_F_SPI_REVA_DMA_RX_FLUSH                         ((uint32_t)(0x1UL << MXC_F_SPI_REVA_DMA_RX_FLUSH_POS)) /**< DMA_RX_FLUSH Mask */

 #define MXC_F_SPI_REVA_DMA_RX_LVL_POS                       24 /**< DMA_RX_LVL Position */
 #define MXC_F_SPI_REVA_DMA_RX_LVL                           ((uint32_t)(0x3FUL << MXC_F_SPI_REVA_DMA_RX_LVL_POS)) /**< DMA_RX_LVL Mask */

 #define MXC_F_SPI_REVA_DMA_DMA_RX_EN_POS                    31 /**< DMA_DMA_RX_EN Position */
 #define MXC_F_SPI_REVA_DMA_DMA_RX_EN                        ((uint32_t)(0x1UL << MXC_F_SPI_REVA_DMA_DMA_RX_EN_POS)) /**< DMA_DMA_RX_EN Mask */

/**@} end of group SPI_DMA_Register */

/**
 * @ingroup  spi_registers
 * @defgroup SPI_INTFL SPI_INTFL
 * @brief    Register for reading and clearing interrupt flags. All bits are write 1 to
 *           clear.
 * @{
 */
 #define MXC_F_SPI_REVA_INTFL_TX_THD_POS                     0 /**< INTFL_TX_THD Position */
 #define MXC_F_SPI_REVA_INTFL_TX_THD                         ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_TX_THD_POS)) /**< INTFL_TX_THD Mask */

 #define MXC_F_SPI_REVA_INTFL_TX_EM_POS                      1 /**< INTFL_TX_EM Position */
 #define MXC_F_SPI_REVA_INTFL_TX_EM                          ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_TX_EM_POS)) /**< INTFL_TX_EM Mask */

 #define MXC_F_SPI_REVA_INTFL_RX_THD_POS                     2 /**< INTFL_RX_THD Position */
 #define MXC_F_SPI_REVA_INTFL_RX_THD                         ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_RX_THD_POS)) /**< INTFL_RX_THD Mask */

 #define MXC_F_SPI_REVA_INTFL_RX_FULL_POS                    3 /**< INTFL_RX_FULL Position */
 #define MXC_F_SPI_REVA_INTFL_RX_FULL                        ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_RX_FULL_POS)) /**< INTFL_RX_FULL Mask */

 #define MXC_F_SPI_REVA_INTFL_SSA_POS                        4 /**< INTFL_SSA Position */
 #define MXC_F_SPI_REVA_INTFL_SSA                            ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_SSA_POS)) /**< INTFL_SSA Mask */

 #define MXC_F_SPI_REVA_INTFL_SSD_POS                        5 /**< INTFL_SSD Position */
 #define MXC_F_SPI_REVA_INTFL_SSD                            ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_SSD_POS)) /**< INTFL_SSD Mask */

 #define MXC_F_SPI_REVA_INTFL_FAULT_POS                      8 /**< INTFL_FAULT Position */
 #define MXC_F_SPI_REVA_INTFL_FAULT                          ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_FAULT_POS)) /**< INTFL_FAULT Mask */

 #define MXC_F_SPI_REVA_INTFL_ABORT_POS                      9 /**< INTFL_ABORT Position */
 #define MXC_F_SPI_REVA_INTFL_ABORT                          ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_ABORT_POS)) /**< INTFL_ABORT Mask */

 #define MXC_F_SPI_REVA_INTFL_MST_DONE_POS                   11 /**< INTFL_MST_DONE Position */
 #define MXC_F_SPI_REVA_INTFL_MST_DONE                       ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_MST_DONE_POS)) /**< INTFL_MST_DONE Mask */

 #define MXC_F_SPI_REVA_INTFL_TX_OV_POS                      12 /**< INTFL_TX_OV Position */
 #define MXC_F_SPI_REVA_INTFL_TX_OV                          ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_TX_OV_POS)) /**< INTFL_TX_OV Mask */

 #define MXC_F_SPI_REVA_INTFL_TX_UN_POS                      13 /**< INTFL_TX_UN Position */
 #define MXC_F_SPI_REVA_INTFL_TX_UN                          ((uint32_t)(0x1UL << MXC_F_SPI_REVA_INTFL_TX_UN_POS)) /**< INTFL_TX_UN Mask */

